hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
#pragma once

#if defined(ESP32_DASHBOARD) && !defined(NATIVE_BUILD)

#ifdef ESP_PLATFORM
#include "platform/espidf_runtime.h"
#else
#include <WiFi.h>
#include <WiFiUdp.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <WebServer.h>
#include <ArduinoOTA.h>
#include <Update.h>
#endif
#include <esp_task_wdt.h>
#ifdef ESP_PLATFORM
#include <driver/temperature_sensor.h>
#include <esp_chip_info.h>
#include <esp_flash.h>
#include <esp_heap_caps.h>
#include <esp_image_format.h>
#include <esp_mac.h>
#include <esp_ota_ops.h>
#include <esp_pm.h>
#include <esp_sleep.h>
#include <esp_spiffs.h>
#include <esp_system.h>
#include <esp_timer.h>
#include <esp_wifi.h>
#include <driver/gpio.h>
#include <esp_private/esp_clk.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#endif
#ifndef ESP_PLATFORM
#include <Preferences.h>
#include <SPIFFS.h>
#endif
#include "handlers.h"
#include "can_helpers.h"
#include <ArduinoJson.h>
#if defined(DRIVER_ESP32_EXT_MCP2515)
#include "drivers/esp32_mcp2515_driver.h"
#endif
#include "web/mcp2515_dashboard_ui.h"

#ifndef DASH_SSID
#error "Define -DDASH_SSID in build_flags (e.g. -DDASH_SSID=\\\"ADUnlock-1234\\\")"
#endif
#ifndef DASH_PASS
#error "Define -DDASH_PASS in build_flags (min 8 chars)"
#endif
#ifndef DASH_OTA_PASS
#error "Define -DDASH_OTA_PASS in build_flags"
#endif
#ifndef DASH_OTA_USER
#error "Define -DDASH_OTA_USER in build_flags"
#endif

static_assert(sizeof(DASH_SSID) > 1 && sizeof(DASH_SSID) <= 33, "DASH_SSID must be 1-32 bytes");
static_assert(sizeof(DASH_PASS) >= 9 && sizeof(DASH_PASS) <= 65, "DASH_PASS must be 8-64 bytes");

#ifndef DASH_DEFAULT_HW
#define DASH_DEFAULT_HW 1
#endif

#if defined(DASH_INJECTION_ON_BOOT)
static constexpr bool kDashInjectionDefaultEnabled = true;
#else
static constexpr bool kDashInjectionDefaultEnabled = false;
#endif

#if defined(DRIVER_TWAI)
#ifndef TWAI_TX_PIN
#define TWAI_TX_PIN GPIO_NUM_5
#endif
#ifndef TWAI_RX_PIN
#define TWAI_RX_PIN GPIO_NUM_4
#endif
#endif

#if DASH_DEFAULT_HW < 0 || DASH_DEFAULT_HW > 2
#error "DASH_DEFAULT_HW must be 0 (LEGACY), 1 (HW3), or 2 (HW4)"
#endif

#define PREFS_NS "ADunlock"
static constexpr uint8_t kDashUnsetU8 = 0xFF;

static Preferences prefs;

static CarManagerBase *dashHandler = nullptr;
static CanDriver *dashDriver = nullptr;
#if defined(DRIVER_ESP32_EXT_MCP2515)
static MCP2515 *dashMcp = nullptr;
#endif

static unsigned long rxCount = 0;
static unsigned long txCount = 0;
static unsigned long txErrCount = 0;
static unsigned long lastFrameMs = 0;
static unsigned long startMs = 0;
static bool canOnline = false;
static uint8_t followDist = 0;

static unsigned long fpsFrames = 0;
static unsigned long fpsLastMs = 0;
static float fps = 0.0f;

static unsigned long muxRx[4] = {};
static unsigned long muxTx[4] = {};
static unsigned long muxErr[4] = {};

#if defined(DRIVER_ESP32_EXT_MCP2515)
static uint8_t mcpEflg = 0;
#else
static const uint8_t mcpEflg = 0;
#endif

static uint8_t hwMode = DASH_DEFAULT_HW;
static bool canActive = kDashInjectionDefaultEnabled;
static bool forceActivate = false;
// AP Injection Gate — when false (default), 1021 mux0 bit46 注入与车辆状态解耦，
// 复刻 2.5.2 真车固件默认行为（kDashApGateDefaultEnabled=false）。
// 当 true 时回到 3.0 早期行为：必须 Parked||APActive||Summoning 才允许注入。
static bool apInjectionGate = false;
static bool apAutoRestore = false;
static bool dashAutoSleepEnabled = false;
static bool dashSleepActive = false;
static bool dashSleepWakeRequested = false;
static const char *dashSleepWakeReason = "none";
static bool dashSleepSavedCanActive = false;
static bool dashSleepSavedForceActivate = false;
static unsigned long dashSleepCandidateSinceMs = 0;
static unsigned long dashSleepEnteredMs = 0;
static uint32_t dashSleepEnterCount = 0;
static uint32_t dashSleepPersistBootCount = 0;
static uint32_t dashSleepPersistTotalCount = 0;
static uint32_t dashSleepPersistCanWakeCount = 0;
static uint32_t dashSleepPersistRebootWakeCount = 0;
static uint32_t dashSleepCurrentRxCount = 0;
static uint32_t dashSleepLastRxCount = 0;
static uint32_t dashSleepLastEnterUptimeSec = 0;
static uint32_t dashSleepLastWakeUptimeSec = 0;
static constexpr uint32_t kDashSleepDurationUnknown = 0xFFFFFFFFUL;
static uint32_t dashSleepLastDurationSec = kDashSleepDurationUnknown;
static char dashSleepLastWakeSource[16] = "none";
static char dashSleepLastWakeReason[24] = "none";
static char dashSleepLastResetReason[24] = "unknown";
static bool dashSleepLastEndedByReboot = false;
static bool dashSleepGearKnown = false;
static uint8_t dashSleepGear = 7;
static unsigned long dashSleepGearSeenMs = 0;
static bool dashSleepLockLatched = false;
static const char *dashSleepLockSource = "none";
static unsigned long dashSleepLockLatchedMs = 0;
static bool dashSleepUiLockKnown = false;
static uint8_t dashSleepUiLockRequest = 0xFF;
static unsigned long dashSleepUiLockSeenMs = 0;
static bool dashSleepVcsecKnown = false;
static uint8_t dashSleepVcsecVehicleLockStatus = 0xFF;
static uint8_t dashSleepVcsecSimpleLockStatus = 0xFF;
static unsigned long dashSleepVcsecSeenMs = 0;
static bool dashSleepDriverKnown = false;
static bool dashSleepDriverPresent = false;
static unsigned long dashSleepDriverSeenMs = 0;
static constexpr int8_t kDashSleepSeatUnknown = -1;
static constexpr int8_t kDashSleepSeatEmpty = 0;
static constexpr int8_t kDashSleepSeatOccupied = 1;
static int8_t dashSleepSeatDriver = kDashSleepSeatUnknown;
static int8_t dashSleepSeatPassenger = kDashSleepSeatUnknown;
static int8_t dashSleepSeatRearLeft = kDashSleepSeatUnknown;
static int8_t dashSleepSeatRearCenter = kDashSleepSeatUnknown;
static int8_t dashSleepSeatRearRight = kDashSleepSeatUnknown;
static unsigned long dashSleepSeatSeenMs = 0;
static bool dashSleepDiPowerKnown = false;
static uint8_t dashSleepDiPowerState = 0xFF;
static bool dashSleepEpasKnown = false;
static uint8_t dashSleepEpasPowerMode = 0xFF;
static unsigned long dashSleepEpasSeenMs = 0;
static constexpr unsigned long kDashAutoSleepDelayMs = 10000;
static constexpr unsigned long kDashSleepLightSliceUs = 500000;
static constexpr unsigned long kDashSleepLockFallbackMs = 30000;
static constexpr unsigned long kDashSleepDriveSignalFreshMs = 30000;
static constexpr unsigned long kDashSleepLatchedLockFreshMs = 60000;
// How recently the module must have injected an FSD frame to count as "AP in
// use" and block light sleep (grey-steering-wheel safeguard).
static constexpr unsigned long kDashSleepApInjectFreshMs = 3000;
// 上一次 dashPostProcessFrame 实际发送成功的时间戳，便于 /status 区分"在持续发"与
// "发了几次就停"，与 framesSent 单调累计计数互补。跨 CAN 任务 / dashboard 任务读写。
static volatile uint32_t lastInjectMs = 0;
static bool dashSpeedProfileAuto = true;
static uint8_t dashManualSpeedProfile = 1;

// HW3 slew limiter constants/state moved to include/dash_hw3_speed.h so
// HW3Handler can call dashApplyHw3OffsetSlew directly.

// HW3 custom-speed config + helpers live in their own header so handlers.h
// (parsed before this file) can read fusedSpeedLimitRaw and call the
// encoders. See include/dash_hw3_speed.h.

#ifdef RGB_BRIGHTNESS
static constexpr uint8_t kDashLedBrightnessDefault = RGB_BRIGHTNESS;
#else
static constexpr uint8_t kDashLedBrightnessDefault = 32;
#endif
static constexpr uint8_t dashLedBrightness = kDashLedBrightnessDefault;

