hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
    // Park fallback: some harnesses stop publishing a clean P value after the
    // car is locked/asleep and only leave SNA/invalid plus low-power hints.
    bool gearLowPower = dashSleepGearKnown &&
                        (dashSleepGear == 0 || dashSleepGear == 7 ||
                         !dashSleepSignalFresh(dashSleepGearSeenMs, kDashSleepDriveSignalFreshMs));
    bool epasLowPower = dashSleepEpasKnown &&
                        dashSleepSignalFresh(dashSleepEpasSeenMs, kDashSleepLockFallbackMs * 2) &&
                        (dashSleepEpasPowerMode == 0 || dashSleepEpasPowerMode == 6);
    bool diLowPower = dashSleepDiPowerKnown &&
                      dashSleepSignalFresh(dashSleepDriverSeenMs, kDashSleepLockFallbackMs * 2) &&
                      (dashSleepDiPowerState == 0 || dashSleepDiPowerState == 4);

    return gearLowPower && (epasLowPower || diLowPower);
}

static bool dashSleepVehicleEmptyReady()
{
    if (dashSleepSeatOccupied())
        return false;
    if (dashSleepAllSeatsKnownEmpty())
        return true;
    if (dashSleepDriverKnown && dashSleepDriverPresent &&
        dashSleepSignalFresh(dashSleepDriverSeenMs, kDashSleepDriveSignalFreshMs))
        return false;
    if (dashSleepDriverKnown && !dashSleepDriverPresent)
        return true;
    if (dashSleepLockLatched &&
        dashSleepSignalFresh(dashSleepLockLatchedMs, kDashSleepLatchedLockFreshMs) &&
        !dashSleepRecentDriveEvidence())
        return true;

    // If driver-present is not visible on this harness, a quiet low-power
    // parked state is the practical empty-cabin fallback.
    return dashSleepParkStateFallbackReady() && !dashSleepRecentUnlockEvidence();
}

static bool dashSleepLowPowerLockFallbackReady()
{
    if (dashSleepRecentUnlockEvidence())
        return false;

    // Some harnesses never expose 0x273/0x339 after lock. Treat the car as
    // locked only when drive evidence is gone and low-power parked-state
    // hints remain. This is intentionally independent from cabin inference to
    // avoid deadlock when 0x3A1 driver-present is not visible on the harness.
    return dashSleepParkStateFallbackReady();
}

static bool dashSleepEffectiveLocked()
{
    return (dashSleepLockLatched &&
            dashSleepSignalFresh(dashSleepLockLatchedMs, kDashSleepLatchedLockFreshMs)) ||
           dashSleepLowPowerLockFallbackReady();
}

static const char *dashSleepEffectiveLockSource()
{
    if (dashSleepLockLatched &&
        dashSleepSignalFresh(dashSleepLockLatchedMs, kDashSleepLatchedLockFreshMs))
        return dashSleepLockSource;
    if (dashSleepLowPowerLockFallbackReady())
        return "fallback";
    return "none";
}

static bool dashSleepParkStateReady()
{
    if (dashSleepGearKnown)
    {
        if (dashSleepGear == 1)
            return true;
        // R/N/D are definitive awake/drive states. INVALID/SNA may be emitted
        // while modules are powering down, so allow the lock-state fallback.
        if ((dashSleepGear == 2 || dashSleepGear == 3 || dashSleepGear == 4) &&
            dashSleepSignalFresh(dashSleepGearSeenMs, kDashSleepDriveSignalFreshMs))
            return false;
    }

    return dashSleepParkStateFallbackReady();
}

static bool dashSleepDriverClearReady()
{
    return dashSleepVehicleEmptyReady();
}

// Safeguard A: never enter light sleep while Autopilot/FSD is actively engaged
// or while the module is actively injecting FSD frames. Sleeping there would
// halt CAN and make the grey steering wheel (AP/EAP available) flicker.
// Uses dynamic in-use signals only: APActive and a recent injection. The
// static GTW_autopilot capability value is intentionally NOT used as a gate
// because it is permanently >=1 on AP-equipped cars and would disable sleep.
static bool dashSleepApBusy()
{
    if (dashHandler && (bool)dashHandler->APActive)
        return true;
    if (canActive && forceActivate &&
        dashSleepSignalFresh(lastInjectMs, kDashSleepApInjectFreshMs))
        return true;
    return false;
}

static const char *dashSleepBlockReason()
{
    if (!dashAutoSleepEnabled)
        return "off";
    if (dashSleepActive)
        return "sleeping";
    if (Update.isRunning())
        return "ota running";
    if (dashSleepApBusy())
        return "AP active/injecting";
    if (!dashSleepParkStateReady())
    {
        if (!dashSleepGearKnown)
            return "waiting P or park state";
        if (dashSleepGear == 0 || dashSleepGear == 7)
            return "waiting park fallback";
        return "gear not P";
    }
    if (dashSleepSeatOccupied())
        return "seat occupied";
    if (!dashSleepDriverClearReady())
        return dashSleepDriverKnown ? "driver present" : "waiting driver empty";
    if (!dashSleepEffectiveLocked())
        return "waiting lock 0x273/0x339";
    if (dashSleepCandidateSinceMs)
        return "pending 10s";
    return "ready";
}

static bool dashSleepParkLockReady()
{
    if (!dashAutoSleepEnabled || dashSleepActive || Update.isRunning())
        return false;
    if (dashSleepApBusy())            // A: never sleep while AP active/injecting
        return false;
    if (!dashSleepParkStateReady())   // 2: gear == P, or low-power park fallback
        return false;
    if (dashSleepSeatOccupied())      // cabin not empty
        return false;
    if (!dashSleepDriverClearReady()) // cabin empty (driver + seats)
        return false;
    if (!dashSleepEffectiveLocked())  // vehicle locked
        return false;
    return true;
}

static bool dashSleepVcsecStatusLocked(uint8_t status)
{
    return status == 2 || status == 5 || status == 8 ||
           status == 10 || status == 12 || status == 15;
}

static bool dashSleepVcsecStatusUnlocked(uint8_t status)
{
    return status == 1 || status == 3 || status == 4 ||
           status == 6 || status == 7 || status == 9 ||
           status == 11 || status == 13 || status == 14;
}

static void dashSleepRequestWake(const char *reason)
{
    if (!dashSleepActive)
        return;
    dashSleepWakeReason = reason;
    dashSleepWakeRequested = true;
}

static void dashSleepObserveFrame(const CanFrame &frame)
{
    if (dashSleepActive)
        dashSleepCurrentRxCount++;
    if (frame.dlc < 3)
        return;

    if (frame.id == 280)
    {
        uint8_t gear = readDIGear(frame);
        dashSleepGearKnown = true;
        dashSleepGear = gear;
        dashSleepGearSeenMs = millis();
        if (gear == 2 || gear == 3 || gear == 4)
        {
            dashSleepClearLockState("drive");
            dashSleepRequestWake("gear");
        }
    }
    else if (frame.id == 627)
    {
        uint8_t lockRequest = static_cast<uint8_t>(dashReadLeBits(frame, 17, 3));
        dashSleepUiLockKnown = true;
        dashSleepUiLockRequest = lockRequest;
        dashSleepUiLockSeenMs = millis();
        if (lockRequest == 1 || lockRequest == 4)
        {
            dashSleepLatchLock("0x273");
        }
        else if (lockRequest == 2 || lockRequest == 3)
        {
            dashSleepClearLockState("0x273");
            dashSleepRequestWake("unlock");
        }
    }
    else if (frame.id == 825)
    {
        uint8_t vehicleLockStatus = static_cast<uint8_t>(dashReadLeBits(frame, 12, 4));
        uint8_t simpleLockStatus = static_cast<uint8_t>(dashReadLeBits(frame, 54, 2));
        dashSleepVcsecKnown = true;
        dashSleepVcsecVehicleLockStatus = vehicleLockStatus;
        dashSleepVcsecSimpleLockStatus = simpleLockStatus;
        dashSleepVcsecSeenMs = millis();
        if (simpleLockStatus == 2 || dashSleepVcsecStatusLocked(vehicleLockStatus))
        {
            dashSleepLatchLock("0x339");
        }
        else if (simpleLockStatus == 1 || dashSleepVcsecStatusUnlocked(vehicleLockStatus))
        {
            dashSleepClearLockState("0x339");
            dashSleepRequestWake("unlock");
        }
    }
    else if (frame.id == 929 && frame.dlc >= 2)
    {
        dashSleepDriverKnown = true;
        dashSleepDriverPresent = dashReadLeBits(frame, 7, 1) != 0;
        dashSleepDriverSeenMs = millis();
        dashSleepSetSeatState(dashSleepSeatDriver,
                              dashSleepDriverPresent ? kDashSleepSeatOccupied : kDashSleepSeatEmpty);
        dashSleepSetSeatState(dashSleepSeatPassenger,
                              dashReadLeBits(frame, 8, 1) ? kDashSleepSeatOccupied : kDashSleepSeatEmpty);
        if (frame.dlc >= 6)
        {
            // 0x3A1 rear-row "unbuckled" values only prove occupancy when the
            // chime reports OCCUPIED_AND_UNBUCKLED; value 0 can also mean a
            // seated passenger is buckled, so do not use it as "empty".
            if (dashReadLeBits(frame, 36, 2) == 1)
                dashSleepSetSeatState(dashSleepSeatRearLeft, kDashSleepSeatOccupied);
            if (dashReadLeBits(frame, 38, 2) == 1)
                dashSleepSetSeatState(dashSleepSeatRearCenter, kDashSleepSeatOccupied);
            if (dashReadLeBits(frame, 40, 2) == 1)
                dashSleepSetSeatState(dashSleepSeatRearRight, kDashSleepSeatOccupied);
        }
        dashSleepDiPowerKnown = true;
        dashSleepDiPowerState = static_cast<uint8_t>(dashReadLeBits(frame, 10, 3));
        if (dashSleepSeatOccupied())
        {
            dashSleepClearLockState("seat");
            dashSleepRequestWake("seat");
        }
        else if (dashSleepDiPowerState == 3)
        {
            dashSleepClearLockState("driver");
            dashSleepRequestWake("driver");
        }
    }
    else if (frame.id == 962 && frame.dlc >= 8)
    {
        // 0x3C2 VCLEFT_switchStatus mux 0 carries direct seat occupancy
        // switches. On LHD Model 3/Y, front-left is the driver seat.
        if (dashReadLeBits(frame, 0, 2) == 0)
        {
            dashSleepSetSeatState(dashSleepSeatDriver,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 50, 2))));
            dashSleepSetSeatState(dashSleepSeatRearCenter,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 54, 2))));
            dashSleepSetSeatState(dashSleepSeatRearLeft,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 56, 2))));
            dashSleepSetSeatState(dashSleepSeatRearRight,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 58, 2))));
            if (dashSleepSeatOccupied())
            {
                dashSleepClearLockState("seat");
                dashSleepRequestWake("seat");
            }
        }
    }
    else if (frame.id == 963 && frame.dlc >= 6)
    {
        // 0x3C3 VCRIGHT_switchStatus front occupancy switch supplements the
        // 0x3A1 passenger-present bit when this frame is visible on the harness.
        dashSleepSetSeatState(dashSleepSeatPassenger,
                              dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 42, 2))));
        if (dashSleepSeatOccupied())
        {
            dashSleepClearLockState("seat");
            dashSleepRequestWake("seat");
        }
    }
    else if (frame.id == 49)
    {
        dashSleepEpasKnown = true;
        dashSleepEpasPowerMode = static_cast<uint8_t>(dashReadLeBits(frame, 16, 3));
        dashSleepEpasSeenMs = millis();
        if (dashSleepEpasPowerMode == 1 || dashSleepEpasPowerMode == 2)
        {
            dashSleepClearLockState("epas");
            dashSleepRequestWake("epas");
        }
    }
}

static void dashTryApAutoRestore(const CanFrame &trigger, CanDriver &driver)
{
    if (trigger.id != 0x389 || !apAutoRestore)
        return;

    unsigned long now = millis();
    if (!apRestoreState.dasAccDropMs ||
        apRestoreState.lastDropHandledMs == apRestoreState.dasAccDropMs ||
        now - apRestoreState.dasAccDropMs > 250)
        return;

    apRestoreState.lastDropHandledMs = apRestoreState.dasAccDropMs;
    if (!apRestoreState.dasSettingsSeen || now - apRestoreState.dasSettingsMs > 5000)
        return;
    if (!apRestoreState.gearSeen || apRestoreState.gearRaw != 4)
        return;
    if (dashApRestoreBraking() || dashApRestoreStabilityBlocked())
        return;
    if (apRestoreState.lastTxMs && now - apRestoreState.lastTxMs < kDashApRestoreTxCooldownMs)
        return;

    CanFrame modified{};
    modified.id = 0x293;
    modified.bus = CAN_BUS_DEFAULT;
    modified.dlc = 8;
    memcpy(modified.data, apRestoreState.dasSettingsData, 8);
    CanFrame original = modified;
    setBit(modified, 38, true);
    setBit(modified, 24, true);
    uint8_t counter = static_cast<uint8_t>(((apRestoreState.dasSettingsCounter == 0xFF ? 0 : apRestoreState.dasSettingsCounter) + 1) & 0x0F);
    modified.data[7] = static_cast<uint8_t>((modified.data[7] & 0xF0) | counter);
    modified.data[7] = dashCounterChecksumByte(modified);
    if (!framePayloadChanged(original, modified))
        return;

    bool ok = driver.send(modified);
    apRestoreState.lastTxMs = now;
    if (ok)
        lastInjectMs = now;
    dashRecordCanFrame(modified, ok ? 'T' : 'E');
    dashLog("[AP] Auto-restore " + String(ok ? "TX OK" : "TX FAIL"));
}

static void dashPostProcessFrame(const CanFrame &original, CanDriver &driver)
{
    dashSleepObserveFrame(original);
    if (dashSleepActive)
        return;
#if defined(DASH_FSD_252_COMPAT) && DASH_FSD_252_COMPAT
    dashTryApAutoRestore(original, driver);

    if ((hwMode != 0 && hwMode != 1) || !dashInjectionActive())
        return;
    const uint32_t activationId = hwMode == 0 ? 1006 : 1021;
    if (original.id != activationId || original.dlc < 8 || readMuxID(original) != 0)
        return;

