hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
    CanFrame modified = original;
    if (dashHandler && !(bool)dashHandler->speedProfileAuto)
        setSpeedProfileV12V13(modified, (int)dashHandler->speedProfile);
    setBit(modified, 46, true);
    if (!framePayloadChanged(original, modified))
        return;

    if (dashHandler)
        dashHandler->framesSent++;
    bool ok = driver.send(modified);
    if (ok)
        lastInjectMs = millis();
    if (dashHandler && dashHandler->onSend)
        dashHandler->onSend(0, ok);
#else
    (void)original;
    (void)driver;
#endif
}

static bool dashCheckNagDisabled()
{
    return false;
}

static bool dashStaSsidLooksCorrupt(const String &ssid)
{
    return ssid.indexOf("\"ssid\"") >= 0 || ssid.indexOf("{\"") >= 0 ||
           ssid.indexOf("\",\"") >= 0;
}

// dashClampHw3SlewRate / dashLoadHw3SlewRate now in dash_hw3_speed.h.

static uint8_t dashClampSpeedProfileForHw(uint8_t hw, int profile)
{
    int maxProfile = hw == 2 ? 4 : 2;
    if (profile < 0)
        return 0;
    if (profile > maxProfile)
        return static_cast<uint8_t>(maxProfile);
    return static_cast<uint8_t>(profile);
}

static void dashApplySpeedProfileState()
{
    if (!dashHandler)
        return;
    dashHandler->speedProfileAuto = dashSpeedProfileAuto;
    if (!dashSpeedProfileAuto)
        dashHandler->speedProfile = dashClampSpeedProfileForHw(hwMode, dashManualSpeedProfile);
}

// HW3 mux-2 codec + slew limiter live in include/dash_hw3_speed.h so they
// can be shared between HW3Handler (in handlers.h, parsed first) and the
// dashboard HW3 send path below.

static void dashApplyRuntimeState()
{
    forceActivateRuntime = canActive && forceActivate;
    emergencyVehicleDetectionRuntime = false;
    isaSpeedChimeSuppressRuntime = false;
    enhancedAutopilotRuntime = false;
    nagKillerRuntime = false;

    if (dashHandler)
    {
        dashHandler->checkAD = dashCheckADEnabled;
        dashHandler->checkNag = dashCheckNagDisabled;
        dashApplySpeedProfileState();
        if (!canActive)
        {
            dashHandler->ADEnabled = false;
            dashHandler->APActive = false;
        }
    }

#if defined(DASH_RGB_STATUS_LED)
    appRefreshStatusLed();
#endif
}

// Store config
static void dashSavePrefs()
{
    prefs.begin(PREFS_NS, false);
    prefs.putUChar("hw", hwMode);
    prefs.putUChar("hw_def", DASH_DEFAULT_HW);
    prefs.putBool("can", canActive);
    prefs.putBool("force_act", forceActivate);
    prefs.putBool("ap_gate", apInjectionGate);
    prefs.putBool("ap_rst", apAutoRestore);
    prefs.putBool("auto_sleep", dashAutoSleepEnabled);
    prefs.putBool("sp_auto", dashSpeedProfileAuto);
    prefs.putUChar("sp_sel", dashManualSpeedProfile);
    prefs.putBool("eprn", dashHandler ? (bool)dashHandler->enablePrint : true);
    prefs.putBool("h3_slw", hw3OffsetSlew);
    prefs.putUChar("h3_srt", hw3SlewRate);
    // HW3 custom speed-limit boost
    prefs.putBool("h3_cust", hw3CustomSpeed);
    prefs.putBool("h3_hse", hw3HighSpeedEnable);
    prefs.putUChar("h3_enc", hw3WireEncoding);
    char k[8];
    for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
    {
        snprintf(k, sizeof(k), "h3_ct%u", (unsigned)i);
        prefs.putUChar(k, hw3CustomTarget[i]);
    }
    for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
    {
        snprintf(k, sizeof(k), "h3_ht%u", (unsigned)i);
        prefs.putUChar(k, hw3HighSpeedTarget[i]);
    }
    // Legacy MPP custom speed-limit override
    prefs.putBool("lg_mpp_en", legacyMppOverride);
    prefs.putBool("lg_mppc_en", legacyMppCustomEnable);
    prefs.putBool("lg_mpph_en", legacyMppHighSpeedEnable);
    for (uint8_t i = 0; i < kLegacyMppCustomTargetCount; i++)
    {
        snprintf(k, sizeof(k), "lg_ct%u", (unsigned)i);
        prefs.putUChar(k, legacyMppCustomTarget[i]);
    }
    for (uint8_t i = 0; i < kLegacyMppHighSpeedBucketCount; i++)
    {
        snprintf(k, sizeof(k), "lg_ht%u", (unsigned)i);
        prefs.putUChar(k, legacyMppHighSpeedTarget[i]);
    }
    prefs.end();
}

static void dashSetCanActive(bool active, const char *reason = nullptr)
{
    bool changed = (canActive != active) || (forceActivate != active);
    canActive = active;
    forceActivate = active;
    dashApplyRuntimeState();
    dashSavePrefs();
    if (changed)
    {
        String msg = String("[CFG] FSD master switch ") + (active ? "ON" : "OFF");
        if (reason && *reason)
            msg += String(" via ") + reason;
        dashLog(msg);
    }
}

[[maybe_unused]] static void dashToggleCanActive(const char *reason = nullptr)
{
    dashSetCanActive(!canActive, reason);
}

static bool dashApPasswordLengthValid(size_t len)
{
    return len >= kDashMinApPassLen && len <= kDashMaxPassLen;
}

static bool dashApConfigValid(const char *ssid, const char *pass)
{
    size_t ssidLen = strlen(ssid);
    size_t passLen = strlen(pass);
    return ssidLen > 0 && ssidLen <= kDashMaxSsidLen && dashApPasswordLengthValid(passLen);
}

static void dashUseDefaultApConfig()
{
    strlcpy(apSSID, DASH_SSID, sizeof(apSSID));
    strlcpy(apPass, DASH_PASS, sizeof(apPass));
    apHidden = false;
    apRuntimeChannel = kDashApChannel;
}

static uint8_t dashConfiguredApChannel()
{
    return kDashApChannel;
}

static bool dashStaConfigLengthValid(const String &ssid, const String &pass)
{
    return ssid.length() <= kDashMaxSsidLen && pass.length() <= kDashMaxPassLen;
}

static void dashClearLegacyOptionPrefs()
{
    static const char *const keys[] = {
        "fAD",
        "f_AD",
        "f_nag",
        "f_sum",
        "f_isa",
        "f_evd",
        "f_h4o",
        "sp",
        "sp_lock",
    };

    bool removed = false;
    for (const char *key : keys)
    {
        if (!prefs.isKey(key))
            continue;
        prefs.remove(key);
        removed = true;
    }

    if (removed)
        dashLog("[BOOT] Cleared legacy dashboard prefs from NVS");
}

static void dashLoadPrefs()
{
    prefs.begin(PREFS_NS, false);
    dashClearLegacyOptionPrefs();
    dashSleepLoadPersistentDiag(prefs);
    bool hasStoredHw = prefs.isKey("hw");
    uint8_t storedHw = prefs.getUChar("hw", DASH_DEFAULT_HW);
    uint8_t storedDefaultHw = prefs.getUChar("hw_def", kDashUnsetU8);
    bool migratedHw = false;

    hwMode = storedHw <= 2 ? storedHw : DASH_DEFAULT_HW;
    if (!hasStoredHw || storedHw > 2)
        migratedHw = true;

    // If the stored selection only mirrors the old firmware default, follow the
    // new build default after reflashing instead of staying pinned to stale NVS.
    if (storedDefaultHw <= 2 && storedDefaultHw != DASH_DEFAULT_HW && hwMode == storedDefaultHw)
    {
        hwMode = DASH_DEFAULT_HW;
        migratedHw = true;
    }

